In [1]:
import numpy as np
import pandas as pd

In [21]:
df = pd.DataFrame({'Company':['Disney', 'Ford', 'GE', 'GE', 'Ford', 'Disney', 'Ford', 'Disney', 'GE'],
                  'Person':['Enzo', 'Mark', 'Mark', 'Walt', 'Enzo', 'Enzo', 'Jamie', 'Walt', 'Jamie'],
                  'Sales':[900,700,850,1000,1050,650,990,800,900]})

In [22]:
df

  Company Person  Sales
0  Disney   Enzo    900
1    Ford   Mark    700
2      GE   Mark    850
3      GE   Walt   1000
4    Ford   Enzo   1050
5  Disney   Enzo    650
6    Ford  Jamie    990
7  Disney   Walt    800
8      GE  Jamie    900

In [23]:
df.groupby('Company')

In [24]:
by_comp = df.groupby('Company')

In [25]:
by_comp.mean()

              Sales
Company
Disney   783.333333
Ford     913.333333
GE       916.666667

In [26]:
by_comp.std()

              Sales
Company
Disney   125.830574
Ford     187.171935
GE        76.376262

In [27]:
by_comp.describe()

                     Sales
Company
Disney  count     3.000000
        mean    783.333333
        std     125.830574
        min     650.000000
        25%     725.000000
        50%     800.000000
        75%     850.000000
        max     900.000000
Ford    count     3.000000
        mean    913.333333
        std     187.171935
        min     700.000000
        25%     845.000000
        50%     990.000000
        75%    1020.000000
        max    1050.000000
GE      count     3.000000
        mean    916.666667
        std      76.376262
        min     850.000000
        25%     875.000000
        50%     900.000000
        75%     950.000000
        max    1000.000000

In [28]:
by_comp.min()

        Person  Sales
Company
Disney    Enzo    650
Ford      Enzo    700
GE       Jamie    850

In [29]:
by_comp.max()

        Person  Sales
Company
Disney    Walt    900
Ford      Mark   1050
GE        Walt   1000

In [30]:
by_comp.describe().transpose()

Company Disney                                                             \
         count        mean         std    min    25%    50%    75%    max
Sales      3.0  783.333333  125.830574  650.0  725.0  800.0  850.0  900.0

Company  Ford               ...                      GE              \
        count        mean   ...       75%     max count        mean
Sales     3.0  913.333333   ...    1020.0  1050.0   3.0  916.666667

Company
               std    min    25%    50%    75%     max
Sales    76.376262  850.0  875.0  900.0  950.0  1000.0

[1 rows x 24 columns]

In [31]:
by_comp.describe().transpose()['Disney']

       count        mean         std    min    25%    50%    75%    max
Sales    3.0  783.333333  125.830574  650.0  725.0  800.0  850.0  900.0

In [33]:
person = df.groupby('Person')

In [34]:
person.describe()

                    Sales
Person
Enzo   count     3.000000
       mean    866.666667
       std     202.072594
       min     650.000000
       25%     775.000000
       50%     900.000000
       75%     975.000000
       max    1050.000000
Jamie  count     2.000000
       mean    945.000000
       std      63.639610
       min     900.000000
       25%     922.500000
       50%     945.000000
       75%     967.500000
       max     990.000000
Mark   count     2.000000
       mean    775.000000
       std     106.066017
       min     700.000000
       25%     737.500000
       50%     775.000000
       75%     812.500000
       max     850.000000
Walt   count     2.000000
       mean    900.000000
       std     141.421356
       min     800.000000
       25%     850.000000
       50%     900.000000
       75%     950.000000
       max    1000.000000

In [40]:
df.groupby('Sales')